; domain
(define (domain emergency-logistics-transporters)
  (:requirements :strips :typing :action-costs :fluents)

  (:types
    drone location person box content transporter num - object
  )

  (:predicates
    ;; Posiciones
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-box ?c - box ?l - location)
    (at-transporter ?tr - transporter ?l - location)

    ;; Dron con un único brazo
    (arm-free ?d - drone)
    (holding ?d - drone ?c - box)

    ;; Caja dentro del transportador 
    (box-in ?c - box ?tr - transporter)

    ;; Contenido
    (box-has ?c - box ?t - content)
    (full-box ?c - box)
    (person-has ?p - person ?t - content)

    ;; "Números" con objetos
    (siguiente ?a ?b - num)          
    (free-slots ?tr - transporter ?n - num) 
  )

  (:functions
    (total-cost)
    (fly-cost ?from ?to - location)
  )


  ;; Movimientos

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
      (increase (total-cost) (fly-cost ?from ?to))
    )
  )

  (:action fly-with-transporter
    :parameters (?d - drone ?tr - transporter ?from - location ?to - location)
    :precondition (and
      (at-drone ?d ?from)
      (at-transporter ?tr ?from)
      (arm-free ?d)
    )
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
      (not (at-transporter ?d ?from))
      (at-transporter ?d ?to)
      (increase (total-cost) (fly-cost ?from ?to))
    )
  )

 
  (:action pick-box
    :parameters (?d - drone ?c - box ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-box ?c ?l)
      (arm-free ?d)
      (full-box ?c)
    )
    :effect (and
      (holding ?d ?c)
      (not (arm-free ?d))
      (not (at-box ?c ?l))
      (increase (total-cost) 1)
    )
  )

  (:action put-box-in-transporter
    :parameters (?d - drone ?tr - transporter ?c - box ?l - location ?nPrev ?n - num)
    :precondition (and
      (at-drone ?d ?l)
      (at-transporter ?tr ?l)
      (holding ?d ?c)
      (free-slots ?tr ?n)
      (siguiente ?nPrev ?n)
    )
    :effect (and
      (box-in ?c ?tr)
      (not (holding ?d ?c))
      (arm-free ?d)
      (not (free-slots ?tr ?n))
      (free-slots ?tr ?nPrev)
      (increase (total-cost) 1)
    )
  )


  (:action take-box-from-transporter
    :parameters (?d - drone ?tr - transporter ?c - box ?l - location ?n ?nNext - num)
    :precondition (and
      (at-drone ?d ?l)
      (at-transporter ?tr ?l)
      (box-in ?c ?tr)
      (arm-free ?d)
      (free-slots ?tr ?n)
      (siguiente ?n ?nNext)
    )
    :effect (and
      (holding ?d ?c)
      (not (arm-free ?d))
      (not (box-in ?c ?tr))
      (not (free-slots ?tr ?n))
      (free-slots ?tr ?nNext)
      (increase (total-cost) 1)
    )
  )

  (:action deliver
    :parameters (?d - drone ?c - box ?p - person ?l - location ?t - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (holding ?d ?c)
      (box-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (at-box ?c ?l)
      (arm-free ?d)
      (not (holding ?d ?c))
      (not (full-box ?c))
      (increase (total-cost) 1)
    )
  )
)

; problem
(define (problem drone_problem_d1_t1_l4_p5_c8_g5_s3_ct2)
(:domain emergency-logistics-transporters)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	box8 - box
	food - content
	medicine - content
	transporter1 - transporter
	n0 - num
	n1 - num
	n2 - num
	n3 - num
)
(:init
	(= (total-cost) 0)
	(= (fly-cost depot loc1) 210)
	(= (fly-cost depot loc2) 144)
	(= (fly-cost depot loc3) 253)
	(= (fly-cost depot loc4) 189)
	(= (fly-cost loc1 depot) 210)
	(= (fly-cost loc1 loc2) 161)
	(= (fly-cost loc1 loc3) 49)
	(= (fly-cost loc1 loc4) 25)
	(= (fly-cost loc2 depot) 144)
	(= (fly-cost loc2 loc1) 161)
	(= (fly-cost loc2 loc3) 180)
	(= (fly-cost loc2 loc4) 138)
	(= (fly-cost loc3 depot) 253)
	(= (fly-cost loc3 loc1) 49)
	(= (fly-cost loc3 loc2) 180)
	(= (fly-cost loc3 loc4) 66)
	(= (fly-cost loc4 depot) 189)
	(= (fly-cost loc4 loc1) 25)
	(= (fly-cost loc4 loc2) 138)
	(= (fly-cost loc4 loc3) 66)
	(at-drone drone1 depot)
	(arm-free drone1)
	(at-transporter transporter1 depot)
	(free-slots transporter1 n3)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(at-person person1 loc1)
	(at-person person2 loc2)
	(at-person person3 loc3)
	(at-person person4 loc4)
	(at-person person5 loc1)
	(at-box box1 depot)
	(box-has box1 food)
	(full-box box1)
	(at-box box2 depot)
	(box-has box2 food)
	(full-box box2)
	(at-box box3 depot)
	(box-has box3 medicine)
	(full-box box3)
	(at-box box4 depot)
	(box-has box4 medicine)
	(full-box box4)
	(at-box box5 depot)
	(box-has box5 medicine)
	(full-box box5)
	(at-box box6 depot)
	(box-has box6 medicine)
	(full-box box6)
	(at-box box7 depot)
	(box-has box7 medicine)
	(full-box box7)
	(at-box box8 depot)
	(box-has box8 medicine)
	(full-box box8)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 food)
	(person-has person2 medicine)
	(person-has person4 food)
	(person-has person4 medicine)
	(person-has person5 medicine)
	))
(:metric minimize (total-cost))
)

; plan
1. (pick-box drone1 box2 depot)
   deleted: (arm-free drone1) (at-box box2 depot)
   added: (holding drone1 box2)
   goals met: 1 of 6
2. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 0 of 6
3. (deliver drone1 box2 person4 loc4 food)
   deleted: (holding drone1 box2) (full-box box2)
   added: (person-has person4 food) (at-box box2 loc4) (arm-free drone1)
   goals met: 1 of 6
4. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 2 of 6
5. (pick-box drone1 box1 depot)
   deleted: (arm-free drone1) (at-box box1 depot)
   added: (holding drone1 box1)
   goals met: 2 of 6
6. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 1 of 6
7. (deliver drone1 box1 person1 loc1 food)
   deleted: (holding drone1 box1) (full-box box1)
   added: (person-has person1 food) (at-box box1 loc1) (arm-free drone1)
   goals met: 2 of 6
8. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 3 of 6
9. (pick-box drone1 box8 depot)
   deleted: (arm-free drone1) (at-box box8 depot)
   added: (holding drone1 box8)
   goals met: 3 of 6
10. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 2 of 6
11. (deliver drone1 box8 person2 loc2 medicine)
   deleted: (holding drone1 box8) (full-box box8)
   added: (person-has person2 medicine) (at-box box8 loc2) (arm-free drone1)
   goals met: 3 of 6
12. (fly drone1 loc2 loc4)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 loc4)
   goals met: 3 of 6
13. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 4 of 6
14. (pick-box drone1 box7 depot)
   deleted: (arm-free drone1) (at-box box7 depot)
   added: (holding drone1 box7)
   goals met: 4 of 6
15. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 3 of 6
16. (deliver drone1 box7 person4 loc4 medicine)
   deleted: (holding drone1 box7) (full-box box7)
   added: (person-has person4 medicine) (at-box box7 loc4) (arm-free drone1)
   goals met: 4 of 6
17. (fly drone1 loc4 loc1)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc1)
   goals met: 4 of 6
18. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 5 of 6
19. (pick-box drone1 box6 depot)
   deleted: (arm-free drone1) (at-box box6 depot)
   added: (holding drone1 box6)
   goals met: 5 of 6
20. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 4 of 6
21. (deliver drone1 box6 person5 loc1 medicine)
   deleted: (holding drone1 box6) (full-box box6)
   added: (person-has person5 medicine) (at-box box6 loc1) (arm-free drone1)
   goals met: 5 of 6
22. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 6 of 6
